Tekla.Structures.ModelInternal.SharingResult
Implements Tekla.Structures.Model.ISharingResult.

Tekla.Structures.ModelInternal.SharingResult.Code


Tekla.Structures.ModelInternal.SharingResult.ErrorDetails


Tekla.Structures.ModelInternal.SharingResult.State


Tekla.Structures.ModelInternal.SharingResult.Notifications


Tekla.Structures.ModelInternal.SharingResult.NotificationsList
Gets or sets the data to return Tekla.Structures.ModelInternal.SharingResult.Notifications.

Tekla.Structures.ModelInternal.SharingResult.ErrorPath


Tekla.Structures.ModelInternal.SharingResult.PathLengthLimit
